[{"title": "Live updates: Trump classified documents hearing, Fani Willis disqualification closing arguments", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240223210059-donald-trump-february-23-2024-rock-hill-south-carolina-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240223210059-donald-trump-february-23-2024-rock-hill-south-carolina-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240216101733-19-navalny-gallery-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/755b9343-47f7-439f-9429-039e0c6e4381.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/9e97f395-5f33-465f-8953-1ebb0d8ce7ef.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240223210059-donald-trump-february-23-2024-rock-hill-south-carolina-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/b39918b7-1ec5-4a95-aa75-ff53e8651d74.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240229184715-gaza-destruction-jabalya-022224-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f5dc7512-b381-4005-ae45-8820777f3efa.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/50b838a5-d897-4763-b670-473e2ba26be1.JPG"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/trump-classified-documents-fani-willis-03-01-24/index.html", "date": "2024-03-01", "short_description": "Live updates: Trump classified documents hearing, Fani Willis disqualification closing arguments  CNN", "text": "From CNN’s Tierney Sneed, Holmes Lybrand, Denise Royal and Sabrina Souza in Fort Pierce, Florida, with Hannah Rabinowitz, Jeremy Herb and Marshall Cohen in Washington, DC\n\nThe Alto Lee Adams Sr. US Courthouse in Fort Pierce, Florida. Lynne Sladky/AP/File\n\nThe morning session of the hearing in the classified documents case has ended without a decision from the judge on when the case will go to trial.\n\nArguments Friday morning, though ostensibly about scheduling, also touched on discovery demands by the defendants because those demands could affect the timeline.\n\nJudge Aileen Cannon picked apart proposed trial schedules from special counsel Jack Smith and the defendants in the classified documents case.\n\nProsecutors with the special counsel’s office have requested in court filings that the trial begin on July 8, while defense attorneys have proposed that Donald Trump and Carlos De Oliveira’s trial begin on August 12 and Walt Nauta’s trial begins September 9.\n\nIn the hearing Friday, Cannon has had questions that picked apart the prosecution and defense proposed schedules, but she has not said much that shed light on how she is thinking about the timeline.\n\nCannon has, however, stressed that there needs to be “some space” in the schedule leading up to the trial to “allow for flexibility,” particularly around the procedures for deciding how classified information will be handled in the case.\n\n## Documents Case ##", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Biden, Trump visit US-Mexico border in reelection effort", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1a2f1f05-0e2e-4fd8-af06-c020b66c3f40.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/616a16c0-1f27-4a41-ab06-72e27d3ab0ea.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/a910dd82-f3ae-4536-88de-c5b8df596e04.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ac67b44c-a1d0-4c80-8fef-a877c27b75c5.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/4c3c4c67-2835-4e83-9ed3-48d31b8624c5.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-super-tease.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/52ce9c6c-fc5d-4bfc-8c9b-4b53ef474c4f.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/104974ff-1d04-4bed-b48e-2d33ed98eaea.JPG"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/trump-biden-border-election-news-02-29-24/index.html", "date": "2024-02-29", "short_description": "Live updates: Biden, Trump visit US-Mexico border in reelection effort  CNN", "text": "Former President Donald Trump visits the US-Mexico border at Eagle Pass, Texas, as seen from Piedras Negras, Mexico, on February 29. Go Nakamura/Reuters\n\nFormer President Donald Trump on Thursday stoked fears about migrants coming into the United States as railed against President Joe Biden and his border policies as he stood feet from the US-Mexico border in Eagle Pass, Texas.\n\nTrump attempted to tie crime in the US to recent increases in immigration — what he calls it “migrant crime” — despite there being little evidence indicating a connection between immigration and crime. Many researchers actually argue immigrants are less likely to commit crimes.\n\nThe former president said he spoke on Wednesday to the parents of 22-year-old Laken Riley, who was found dead after jogging on the University of Georgia campus. Trump has repeatedly invoked Riley’s death as he pushes for his hardline immigration policies because her suspected killer is an undocumented immigrant from Venezuela.\n\n“These are the people that are coming into our country, and they're coming from jails and they're coming from prisons and they're coming from mental institution and they're coming from insane asylums and they're terrorists. They're being led into our country. And it's horrible,” Trump said as he repeated the typical anti-immigrant rhetoric he uses on the campaign trail.\n\nThe former president praised Texas Gov. Greg Abbott, who has tried to implement a new controversial security initiative. The US Supreme Court recently allowed US Border Patrol agents to remove razor wire deployed by Abbott’s initiative at the US-Mexico border while the state’s legal challenge to the practice plays out.\n\nTrump’s trip to the border comes not long after Trump torpedoed a bipartisan border bill so he could continue campaigning on Biden’s perceived weakness on the border.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: House passes short-term funding bill to avoid partial shutdown", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1011a401-8005-4fc4-aac8-75b587b21304.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/75a002b4-fd2a-4814-94fd-d4c4133a9114.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c7990080-f823-4e5e-afbd-954ddf2be89b.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c6bf5fc4-ebe7-4e65-89e0-ee511fbe4e8f.JPG", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/40833a77-3c82-47b7-93a8-c629a18c44ae.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/government-shutdown-deadline-02-29-24/index.html", "date": "2024-03-01", "short_description": "The latest on funding negotiations as shutdown deadline looms  CNN", "text": "House Republicans expressed frustration Thursday after a short-term bill to fund the government ahead of a Friday deadline passed the House with the help of Democrats after House Speaker Mike Johnson cut a deal with the White House and Senate on government funding.\n\nRep. Chip Roy, a member of the House Freedom Caucus and a deficit hawk, criticized the Speaker over his handling of the issue and lamented that he believes something has to change in Washington.\n\n“It's not where we need to be to actually fundamentally change the town. We have a trillion dollars of interest in 2026, guys. I mean, I don't know what to tell you. Something's got to stop. Something's got to change,\" he said.\n\nRep. Nancy Mace, who was one of the eight lawmakers who voted to strip former Speaker Kevin McCarthy of the gavel, defended her vote even after Johnson reached a deal not too different from what ultimately led to the former Speaker’s ouster.\n\n“He inherited a lot of Kevin McCarthy's bad deals, number one, so I don't fault him for that. But number two, I'm gonna say the same thing I've always said, Republicans and Democrats alike are spending too damn much, period,” she told CNN’s Manu Raju.\n\nWhen pressed by CNN on what policy wins she believes they have achieved following McCarthy's ouster, she pointed to greater transparency from Johnson.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Michigan presidential primary election", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e39e9c2f-668b-4c05-b177-a5c1da774633.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1b5a4083-27eb-4873-a8a8-97c537156ce9.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d4f4e2ea-4521-449d-ad79-5a3d3042dc89.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/fc0070bb-f4a7-44d1-8aef-4103d1ab860b.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/3264073d-d35f-4fb4-810c-8b00cfc97530.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7281ed84-4478-4b12-9db7-c8302417263c.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/index.html", "date": "2024-02-29", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "Republican presidential candidates Donald Trump and Nikki Haley AP/Getty Images\n\nThe Republican presidential primary season has been one long slog for the past month and half.\n\nJust three states – Iowa, New Hampshire and South Carolina – have had caucuses or primaries in which both Donald Trump and Nikki Haley were on the ballot. The small number of nominating contests allowed the candidates to camp out and provide individual attention to each state.\n\nTuesday’s Michigan primary marks a major pivot away from that model. Neither candidate has been able to pay too much attention to the Wolverine State, which makes it a good testing ground for how the GOP primary process will unfold as the campaign becomes nationalized over the next three weeks.\n\nThis is likely very good news for the former president. Trump is the massive favorite in Michigan. Recent polling has been limited, but he led Haley 72% to 27% among likely GOP primary voters in a CNN/SSRS poll conducted at the end of last year. That lead was larger than his advantage in any of the final surveys leading up to the aforementioned three early nominating contests this primary season.\n\nNow, Haley was able to close the gap with Trump in New Hampshire and South Carolina after polls had previously shown her well behind. Even three weeks out from the Palmetto State primary, polls had Haley down by 35 points, but she lost by 20 points after weeks of campaigning.\n\nRead more about why Michigan's primary is key.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Supreme Court to decide Trump immunity claim", "top_image": "https://media.cnn.com/api/v1/images/stellar/prod/231228230243-02-trump-file-122823.jpg?c=16x9&q=w_800,c_fill", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/b4f39436-ae2b-44b9-8c2c-ff19511dc7eb.jpg?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/231228230243-02-trump-file-122823.jpg?c=16x9&q=w_800,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/240228174010-dle-government-shutdown.jpg?c=16x9&q=h_720,w_1280,c_fill/q_auto", "https://media.cnn.com/api/v1/images/stellar/prod/6840e0f3-bfea-4380-aa5b-7071eb279d3c.jpg?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/858e3c99-ed4f-4af1-a193-60d261e9f482.jpg?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/230422192329-biden-trump-split-042223.jpg?c=16x9&q=h_720,w_1280,c_fill/q_auto", "https://media.cnn.com/api/v1/images/stellar/prod/2cdeadc1-38d2-4968-b8e2-537cf58130a8.jpg?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/ebe9eba5-574e-4988-bd0d-f98842917936.jpg?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/230111171322-elise-hammond.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/240227145233-rafah-022724.jpg?c=16x9&q=h_720,w_1280,c_fill/q_auto", "https://media.cnn.com/api/v1/images/stellar/prod/c79f8728-a2b9-41a2-bf2d-6d84fe9a168b.jpg?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/8401a613-3b13-41ea-aedd-d1866f8030e6.JPG?c=original&q=w_1280,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/cf2e3bf3-16e6-429d-b201-7beadbb9cd2c.jpg?c=original&q=w_1280,c_fill"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/trump-legal-cases-court-02-28-24/index.html", "date": "2024-02-29", "short_description": "Supreme Court to decide Trump immunity claim  CNN", "text": "Former President Donald Trump attends a campaign event ahead of the Republican presidential primary election in North Charleston, South Carolina, on February 14. Sam Wolfe/Reuters\n\nFormer President Donald Trump made his final pitch on February 15 to the Supreme Court in his effort to pause a trial over the election subversion charges brought by special counsel Jack Smith.\n\n“There are overwhelming reasons why the case should not go to trial ‘in three months or less,’” Trump told the Supreme Court in a 16-page filing. “With any other defendant, it would be virtually unthinkable for the case to go to trial so soon, and ‘wildly unfair’ to do so.”\n\nTrump claims former presidents must have immunity from such charges to avoid political reprisals when they leave office. So far, two lower federal courts have balked at that argument.\n\nTrump asked the Supreme Court to block a unanimous decision from the DC Circuit handed down that rejected his claims of immunity from the election subversion charges. Smith argued in his own brief that Trump had not met the standard to pause proceedings in his case. It generally takes support from five justices to secure such a pause.\n\nIf the justices deny Trump’s emergency request to temporarily block a DC Circuit ruling against him on the immunity issue, it would clear the way for a US District Court in Washington to schedule a trial on the underlying election charges, which Smith is eager to finish before the November election.\n\nIf the justices agree to further consider his case, it could signal the justices may schedule oral arguments in the case later this year, potentially pushing a trial back several months.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Hunter Biden sits in on closed-door deposition with House Oversight and Judiciary committee", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240110110638-04-hunter-biden-capitol-hill-01-10-2024-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e5088872-d50f-41fb-95ca-0268651e3c76.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/be4a5eac-01ca-478a-91fe-b88561d9138c.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/340e63d9-3106-4719-8931-a4ecfdbe9ed8.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240110110638-04-hunter-biden-capitol-hill-01-10-2024-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/b9f810a7-5e94-4bff-b62e-8e359d264baf.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f3cdb473-8238-4f7d-a546-b96aa46cd3e9.JPG", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/22a74ef9-32e7-4b20-b0a9-e37e160da4d9.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/hunter-biden-deposition-02-28-24/index.html", "date": "2024-02-29", "short_description": "Hunter Biden's closed-door deposition with GOP-led House committees: Live updates  CNN", "text": "Democrats leaving Hunter Biden’s deposition said the president’s son raised the “double standard” of Republicans investigating his business dealings but turning a blind eye to members of the Trump family like Jared Kushner, whose company received a $2 billion investment from Saudi Arabia after leaving the Trump White House.\n\n“I think [Hunter Biden] may be a little bit frustrated by some of the double standards relating to Jared Kushner and money that has been just openly pocketed by Donald Trump in office and Jared Kushner, of course, brought back $2 billion from Saudi Arabia. And all of that has been part of the conversation and he was assertive about that,” said Democratic Rep. Jamie Raskin, the top Democrat on the House Oversight Committee.\n\nDemocratic Rep. Dan Goldman echoed, “I thought one of his most powerful lines is when he made it very clear that none of the business dealings that he ever had were with any government entity, and he pointed out, unlike Jared Kushner has received $2 billion from the Saudi Arabian government as soon as he left office when he was the point person on Middle East policy.”\n\nGoldman said, “We all noticed, I think, that there were some Republicans nodding their head, when Hunter suggested that it would be worth investigating Jared Kushner and his $2 billion from Saudi Arabia.”\n\nDemocratic Rep. Jared Moskowitz said after the president’s son posed the question of why Republicans were not curious about Kushner’s business dealings with Saudi Arabia, “for the first time, some Republicans in the room said, ‘No, we have a problem with that.'”\n\nRaskin said he understood why the president’s son wanted to testify publicly, given how forthright he has been in his answers.\n\n“I understand why Hunter Biden wanted to testify in public because I think he would answer all of the questions that the public has based on all of his propaganda to everybody's satisfaction, and I understand why our Republican colleagues didn't want him to testify in public,” he said.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Supreme Court bump stocks ban oral arguments", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240227162414-bump-stocks-file-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/548a76fc-f087-4144-a65f-39cb09e5a485.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227162414-bump-stocks-file-super-tease.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/aa3bf442-d45a-48e3-a41e-c4d19c86a0cb.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/458b0a2f-095d-4094-8c01-fe259b958715.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/supreme-court-bump-stocks-ban/index.html", "date": "2024-02-28", "short_description": "Live updates: Supreme Court bump stocks ban oral arguments  CNN", "text": "Several conservative Supreme Court justices indicated Wednesday they are concerned with the federal ban on bump stocks, a device that allows semi-automatic weapons to fire more like a machine gun.\n\nJustice Brett Kavanaugh said he was worried about Americans being prosecuted under a ban they aren't aware of. And Justice Amy Coney Barrett said that while she was \"intuitively\" concerned about the bump stock devices, she questioned why the issue wouldn't be better handled by Congress.\n\nThat was a theme that the justices returned to repeatedly, underscoring a push by the court's conservatives to limit the power of federal agencies in recent years.\n\nMeanwhile, the court's three liberals focused on the idea that rifles equipped with bump stocks effectively work like machine guns and can do similar damage if misused.\n\n\"The entire point of this device,\" Justice Elena Kagan said, is that the shooter pushes forward on the weapon while shooting and \"a torrent of bullets shoot out.\"", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "CNN Projection: Donald Trump will win South Carolina GOP primary", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2b98a2ed-19bc-4376-8a1a-7d36bf1a3633.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240223210059-donald-trump-february-23-2024-rock-hill-south-carolina-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240216101733-19-navalny-gallery-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/a339795a-40e3-4cad-a81b-7bcfe520d758.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/76357beb-598f-437d-a4f3-fd468d0fe360.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2b98a2ed-19bc-4376-8a1a-7d36bf1a3633.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/dee85997-d54e-47cb-bcfc-a3aad4aa5413.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240229184715-gaza-destruction-jabalya-022224-small-11.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/8db6d671-96bf-4643-b611-6c8f149b453e.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/6b74e79b-e63b-4fa1-80da-52605b06b20d.jpg"], "videos": [], "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNubi5jb20vcG9saXRpY3MvbGl2ZS1uZXdzL3NvdXRoLWNhcm9saW5hLXByaW1hcnktMDItMjQtMjQvaF9jYzNlMDliM2UyNGVjYzU1YTYxMTAzNWExNWIyOTQzYdIBVWh0dHBzOi8vYW1wLmNubi5jb20vY25uL3BvbGl0aWNzL2xpdmUtbmV3cy9zb3V0aC1jYXJvbGluYS1wcmltYXJ5LTAyLTI0LTI0L2luZGV4Lmh0bWw?oc=5&hl=en-US&gl=US&ceid=US:en", "date": "2024-02-25", "short_description": "The latest on the South Carolina GOP primary and 2024 campaign  CNN", "text": "Former President Donald Trump smiles during a Fox News Channel town hall on Tuesday, February 20, in Greenville, South Carolina. Chris Carlson/AP\n\nFormer President Donald Trump will win South Carolina’s Republican presidential primary, CNN projects, further tightening his grip on the nomination and leaving his last remaining major rival Nikki Haley to consider her dwindling options.\n\nThe former president has swept all GOP nominating contests to date, first beating the field by large margins in Iowa and New Hampshire, before cleaning up in Nevada, where Haley didn’t appear on the ballot, and in the US Virgin Islands.\n\nTrump’s victory now places the onus on Haley, the former South Carolina governor who doubled down earlier this week in a speech, declaring, “I’m not going anywhere.”\n\nThe next stop on the GOP nominating calendar is Michigan, where Republicans will vote in a primary Tuesday. After a few m ore scattered contests, March 5 will bring Super Tuesday – and an opportunity for Trump to draw even closer to wrapping up his third consecutive party nomination.\n\nDefeated on her home turf, Haley’s already struggling campaign is likely to come under renewed pressure from Republicans who want her to drop out and allow Trump to focus exclusively on his likely rematch with President Joe Biden, who won the Palmetto State’s Democratic primary earlier this month with more than 96% of the vote.\n\nThis post has been updated with additional reporting on Trump's South Carolina win.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Fulton County prosecutor's divorce attorney to testify in Fani Willis case", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-super-tease.jpeg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7dc4e4ef-5b65-42d9-803b-c92241092df3.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/73f6af59-d4b6-4c1d-b6c8-44aaa8001145.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1d95a17a-0512-4069-bb5c-06c8e643494d.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e602e5a5-9c7a-44fe-95f8-ac957c3ecfdb.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-super-tease.jpeg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/fani-willis-case-fulton-county-hearing-02-27-24/index.html", "date": "2024-02-27", "short_description": "Live updates: Fulton County prosecutor's divorce attorney to testify in Fani Willis case  CNN", "text": "Terrence Bradley testified Tuesday that he remembers having only one conversation about the romantic relationship between Nathan Wade and Fulton County District Attorney Fani Willis over the more than four years he acted as Wade’s divorce attorney.\n\nUnder questioning from Donald Trump’s attorney, Steve Sadow, Bradley said he represented Wade, the special prosecutor Willis hired to lead the Georgia election subversion case, between 2018 and mid-2022.\n\nDuring that time, Bradley said, he had one conversation with Wade in their shared law office about the relationship.\n\n“You’re testifying under oath that you had one conversation about a relationship between Mr. Wade and Miss Willis?” Sadow asked. “Is that correct?”\n\n“I don’t recall having any other conversation with Mr. Wade about him and Ms. Willis,” Bradley responded.\n\n“Is it your testimony then, that you don’t remember any other conversation or there wasn’t any other conversation besides the one?” Sadow asked.\n\nBradley said he believed that “it was the one” but that he did not determinately remember whether there were others.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Trump wins South Carolina's GOP primary, defeats Haley", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240223180847-trump-haley-sc-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/0f20233b-2802-425e-be3c-347759b14ab6.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/q_auto/https%3A%2F%2Fmedia.cnn.com%2Fapi%2Fv1%2Fimages%2Fstellar%2Fprod%2F240224220108-haleyafgsplit.jpg%3Fc%3D16x9%26q%3Dw_800%2Cc_fill", "https://cdn.cnn.com/cnnnext/dam/assets/240223180847-trump-haley-sc-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/04967e58-d0d3-45ca-8865-f405fa75d1c0.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2679d6e4-b73c-4683-99f1-b2beb075f2a7.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/553515db-ad3c-41be-8fac-d492a9e805aa.JPG", "https://dynaimage.cdn.cnn.com/cnn/q_auto/https%3A%2F%2Fmedia.cnn.com%2Fapi%2Fv1%2Fimages%2Fstellar%2Fprod%2F240224224808-chris-sununu-jake-tapper-split-february-24-2024-screengrab-for-video.jpg%3Fc%3D16x9%26q%3Dw_800%2Cc_fill", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/0c635c0e-4e5a-4a93-8ea6-7fe01e6eb2c8.JPG"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/south-carolina-primary-02-24-24/index.html", "date": "2024-02-25", "short_description": "The latest on the South Carolina GOP primary and 2024 campaign  CNN", "text": "Former President Donald Trump attends a primary election night party at the South Carolina State Fairgrounds in Columbia on Saturday. Andrew Harnik/AP\n\nDonald Trump has won the South Carolina Republican presidential primary, defeating Nikki Haley on her home turf as he completed his sweep of the early voting states.\n\nThe race accelerates now: The slow march through the early voting states is over, and the primary is now a national one. By March 12, 56% of the delegates to the Republican National Convention will have been awarded. And in most states, Republicans’ delegates are winner-take-all — which means Haley gets no credit for strong second-place showings. With Haley winless so far, the finish line — 1,215 delegates necessary to clinch the nomination — could be in sight for Trump within weeks.\n\nTrump dominates the GOP establishment — again: In case it wasn’t clear when he won the nomination in 2016, became president, ran all but a select few Republican critics out of office or the party, then stormed into the 2024 race despite facing multiple indictments: The GOP belongs to Donald Trump. Trump's success in Haley’s home state underscores how much has changed in less than a decade. Nor has it been a hostile takeover, no matter how hostile Trump can be toward his rivals: Most Republican voters are all in on Trump, and the parts of his personality that make establishment Republicans cringe are — as we’ve seen — actually a large part of his appeal to a majority of voters.\n\nWhere does Haley go from here? There was once a narrow, but tantalizing, path for Haley to seriously challenge Trump for the Republican nomination. It started with winning in New Hampshire and her home state. But that potentially game-changing stretch of the Republican primary race is over. Following Saturday's projected loss, Haley's campaign announced a swing through Michigan, Minnesota, Colorado and Utah starting Sunday, and she’s also spending money on advertising targeting Super Tuesday states. Whether she’ll actually notch any wins and begin to seriously challenge Trump in the delegate race, though, is a tougher question.\n\nNikki Haley arrives to speaks to supporters after the South Carolina presidential primary on Saturday in Charleston. Chris Carlson/AP\n\nA big enough pro-Haley coalition doesn't exist in GOP primaries: Haley’s campaign has long touted general election polls that show her in a much stronger position than Trump in a hypothetical matchup against Biden. But she can’t skip the step of defeating Trump in a primary first. There’s long been a theoretical coalition for Haley that includes moderate Republicans, independents allowed to vote in Republican primaries in some states and those turned off by Trump — particularly suburban, college-educated voters who have fled the party since Trump’s ascension in 2016. But that coalition isn’t showing up for Haley in the primary — at least not in enough force.\n\nTim Scott's veepstakes audition: The most important result of South Carolina’s primary might be the cozy relationship Trump seemed to develop with his onetime 2024 GOP primary rival, Sen. Tim Scott. The last few weeks may have served as Scott’s audition for the vice presidential nomination. He campaigned with Trump, appeared alongside him in a Fox News town hall and other interviews, and urged Haley — who appointed him to his Senate seat when she was governor — to get out of the race.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Biden and Trump will win Michigan primaries, CNN projects", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/5c8710cd-0a08-4f53-ac53-8023f071171e.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/60b9d2b0-1fee-42e2-a980-ebc0837aaa8d.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ea1d2ca4-0516-436c-a22c-ba0f34fff802.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f7d70238-a423-4763-adaf-7e34a2b800be.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/416d4844-90b1-4d2d-9d47-9525335c85ff.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24#h_0c269e4c412eb66af5eb542f3f0e7d3e", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "President Joe Biden smiles as he meets with law enforcement officials at the White House on Wednesday, February, 28. Andrew Harnik/AP\n\nPresident Joe Biden “continues to be fit for duty” after his annual physical was conducted at Walter Reed, Dr. Kevin O’Connor said in a memo Wednesday, adding that there are “no new concerns” from this year’s physical.\n\n“The President feels well and this year’s physical identified no new concerns. He continues to be fit for duty and fully executes all of his responsibilities without any exemptions or accommodations,\" the doctor said.\n\nO’Conner concluded his letter: “President Biden is a healthy, active, robust 81-year-old male, who remains fit to successfully execute the duties of the Presidency, to include those as Chief Executive, Head of State and Commander in Chief.”\n\nEarlier Wednesday, Biden joked about his age while telling reporters about his annual physical. “They think I look too young,” Biden said, adding that there was nothing different from last year’s physical.\n\nAt 81, Biden is the oldest president to have held the office. He would be 86 years old at the end of a potential second term. He has been persistently dogged by criticism and concerns over his age and stamina. In a CNN poll conducted by SSRS released earlier this month, 46% of Democrats were concerned about his age.\n\nThe White House said the doctor assessed that the president “doesn’t need a cognitive test.” White House press secretary Karine Jean-Pierre said that the president’s physician was “happy” with how the president’s annual physical went.\n\nA cognitive test has not been part of a standard presidential physical. If Biden or his doctor had a specific concern, his doctor could perform a brief assessment that might determine whether further evaluation is recommended.\n\nWhen the president has received his physical in the past, his physician — Dr. Kevin O’Connor — has issued a report on the president’s health. Presidents are under no legal requirement to release information about their health and can choose which details are made public.\n\nThis post has been updated with additional details on Biden's physical.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Trump and Biden win in key battleground Michigan. Catch up on the action", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c8cc3e67-5837-460c-b42b-10b2f2636ced.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1378dfad-f142-4166-9961-62ae5b640cfa.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/53b9e4cc-cff1-4c1b-bf10-f1c5f4ef1dff.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c8cc3e67-5837-460c-b42b-10b2f2636ced.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/22f50626-e202-4c35-aad7-a7445adfdb5f.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/676e5027-8647-4cf6-8a57-0cbdf31c355c.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_1ee8d37ccf012d1ef865835918936c20", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "Drew Angerer, Mario Tama/Getty Images\n\nThe final polls in Michigan closed just over an hour ago, but the two projected winners are already clear.\n\nCNN has projected President Joe Biden will win Michigan’s Democratic primary and former President Donald Trump will win the state’s Republican primary.\n\nBiden is on a glide course to the Democratic nomination for a second term, while the former president barrels toward the GOP nod for the third straight election.\n\nTrump’s win further shuts the door on former South Carolina Gov. Nikki Haley’s hopes of building momentum ahead of next week’s Super Tuesday contests, when more than one-third of the party’s delegates are at stake.\n\nHere’s a look at the latest vote tally:\n\nRepublican presidential primary, with about 22% of the estimated vote in:\n\nTrump: 66.7%\n\nHaley: 28.4%\n\nDemocratic presidential primary, with about 22% of the estimated vote in:\n\nBiden: 79.7%\n\nUncommitted: 14.5%\n\nMarianne Williamson: 2.9%\n\nDean Phillips: 2.8%\n\nHere’s what else to know:", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Biden tries out a new line of attack against Trump: Mocking the former president’s age", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/8150921f-df52-4948-8c38-254dba346ad1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/22fc2cbc-0d58-4385-a5f3-95efc8e4dfba.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/533d6455-9f9d-4111-b622-c1b0a1a703e4.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f4ec115c-9a2c-4ce8-bc33-3cc0e247aab2.png", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/593ee239-07d6-4169-a044-be711ea6a9d6.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/b77d4bf7-407b-4696-80df-c1cebf61970a.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1ae225b9-2c79-4d79-979e-4e2e45f13965.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/879df60a-a190-4423-9b25-bee84933f27c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/faecc978-ef0a-4773-9643-95ca79d824d1.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_d093a11620d37fc57a92a0223f72049f", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "President Joe Biden on Monday pointedly explored a new line of attack against his once-and-likely-future opponent Donald Trump, mocking Trump’s age as Biden tries to turn the tables on one of his greatest political liabilities.\n\nFiring back against critics who say his own age is a liability in the upcoming election, 81-year-old Biden told Seth Meyers, “You got to take a look at the other guy,” referring to the 77-year-old Trump.\n\n“He’s about as old as I am, but he can’t remember his wife’s name,” he joked, in an apparent reference to an episode over the weekend where the former president mistakenly called his wife Melania “Mercedes” during remarks at CPAC.\n\nDuring the interview on NBC’s “Late Night,” Biden said voters should not just consider how old a candidate is, but “how old (their) ideas are.”\n\nBiden’s comments about Trump’s age could mark a notable shift in the president’s messaging strategy, coming just days after Trump won the South Carolina Republican primaries in another step toward grabbing his party’s presidential nomination. The two men have not often attacked each other over their age and Trump has previously said he doesn’t believe Biden is too old to run for reelection. Instead of attacking Biden directly over his age, Trump instead tries to paint Biden as “incompetent,” and “cognitively impaired,” which he argues is not solely about the president’s age.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Michigan Democratic Sen. Stabenow says she is \"conflicted\" about the \"uncommitted\" vote effort", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ff1e950e-5410-402a-a557-ab1f4c943159.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ff1e950e-5410-402a-a557-ab1f4c943159.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_5c08b8b029a672081c7e6ae22359d395", "date": "2024-02-28", "short_description": "Michigan Democratic Sen. Stabenow says she is \"conflicted\" about the \"uncommitted\" vote effort  CNN", "text": "Michigan Democratic Sen. Debbie Stabenow said this morning that she is \"conflicted\" about the \"uncommitted\" vote effort in her home state's primary election today, protesting President Joe Biden's handling of the Israel-Hamas war.\n\n\"People now are hurting,\" Stabenow told CNN, explaining that voters in Michigan have \"every right to\" express their feelings about the Middle East conflict.\n\n\"There's a lot of pain. We need to hear that,\" she added. \"We need to understand that.\"\n\nStabenow hedged however, that the \"uncommitted\" vote could pose problems for the fall general election — but did not go as far as saying it that could cause Biden to lose Michigan to Donald Trump in a November match-up.\n\nTo hold onto Michigan in 2024, the Biden campaign has to \"be there. They have to show up. They are showing up,\" she said.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Trump ordered to pay nearly $355 million in civil fraud trial", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240111103454-09-trump-civil-fraud-trial-nyc-011124-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f49b138b-4079-447e-87a6-d79a7f93ad25.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240111103454-09-trump-civil-fraud-trial-nyc-011124-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/66a04c6b-d064-4a20-b614-2103f6f29ef4.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/978d49e8-a122-4df8-89e2-84a2d27bee0c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/3bce7628-3a4e-4a08-9d4e-86659b91235c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e0167f32-65e1-4ad9-b850-53973385563d.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/6a5ed545-d3b1-495a-859f-229df93b82b8.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/trump-civil-fraud-trial-decision-02-16-24/index.html", "date": "2024-02-16", "short_description": "Live updates: Trump ordered to pay nearly $355 million in civil fraud trial  CNN", "text": "Donald Trump speaks at his Mar-a-Lago estate, Friday, February 16, in Palm Beach, Florida. Rebecca Blackwell/AP\n\nJudge Arthur Engoron hit Donald Trump with his biggest punishment to date on Friday, in a ruling that fined the former president $355 million for fraudulently inflating the values of his properties.\n\nEngoron found Trump liable for fraud, conspiracy and issuing false financial statements and false business records, and he barred him from serving as director of a company in New York for three years. But while he stopped short of dissolving the Trump Organization altogether, Engoron issued a blistering 93-page opinion that painted the former president as unremorseful and highly likely to commit fraud again.\n\n“Their complete lack of contrition and remorse borders on pathological,” Engoron wrote of Trump and his co-defendants.\n\nHere are key takeaways from the decision:\n\nThe biggest fines yet against Trump: Engoron found that the defendants’ fraud saved them about $168 million in interest, fining Trump and his companies that amount. He also ruled that Trump and his companies were liable for $126 million in ill-gotten profits from the sale of the Old Post Office in Washington, DC, and that Trump and his companies were liable for $60 million in profits from the sale of Ferry Point in the Bronx. Engoron also wrote that Trump would be required for interest on those payments.\n\nEngoron found that the defendants’ fraud saved them about $168 million in interest, fining Trump and his companies that amount. He also ruled that Trump and his companies were liable for $126 million in ill-gotten profits from the sale of the Old Post Office in Washington, DC, and that Trump and his companies were liable for $60 million in profits from the sale of Ferry Point in the Bronx. Engoron also wrote that Trump would be required for interest on those payments. The judge gets the last word: Trump repeatedly attacked Engoron and the case throughout the 11-week trial on social media, outside the courtroom – and even to the judge’s face while he testified. On Friday, Engoron got the last word, painting Trump as a “pathological” fraudster who would not stop unless forced. The judge acknowledged that the sins Trump committed — which his lawyers frequently argued had no victim because banks were repaid and often eager to do business with Trump’s company — were not as serious as some crimes. But he faulted Trump and his co-defendants for a complete lack of contrition.\n\nTrump repeatedly attacked Engoron and the case throughout the 11-week trial on social media, outside the courtroom – and even to the judge’s face while he testified. On Friday, Engoron got the last word, painting Trump as a “pathological” fraudster who would not stop unless forced. The judge acknowledged that the sins Trump committed — which his lawyers frequently argued had no victim because banks were repaid and often eager to do business with Trump’s company — were not as serious as some crimes. But he faulted Trump and his co-defendants for a complete lack of contrition. No corporate death penalty: The judge banned Trump from serving as an officer or director of a New York corporation for three years, but did not issue the so-called corporate death penalty. Engoron pulled back from a decision he issued a summary judgment in September dissolving Trump’s business certificates in finding that Trump and his co-defendants were liable for persistent and repeated fraud. But, the independent monitor installed last fall will stay in place for at least three years and an independent director of compliance should be put in place at the Trump Org. at the company’s expense, the ruling said.\n\nThe judge banned Trump from serving as an officer or director of a New York corporation for three years, but did not issue the so-called corporate death penalty. Engoron pulled back from a decision he issued a summary judgment in September dissolving Trump’s business certificates in finding that Trump and his co-defendants were liable for persistent and repeated fraud. But, the independent monitor installed last fall will stay in place for at least three years and an independent director of compliance should be put in place at the Trump Org. at the company’s expense, the ruling said. Judge says Cohen told the truth: Engoron recapped Michael Cohen’s theatrical trial testimony, acknowledging the credibility issues with Trump’s former lawyer and fixer. But ultimately, Engoron said, he believed Cohen.\n\nEngoron recapped Michael Cohen’s theatrical trial testimony, acknowledging the credibility issues with Trump’s former lawyer and fixer. But ultimately, Engoron said, he believed Cohen. Trump’s adult sons banned for 2 years: Trump’s eldest sons – who’ve essentially run the Trump Organization since 2017 – are barred from serving as executives in New York for two years, according to Engoron’s order. The Trumps will have to navigate the two-year penalty as they sort out the future of the family-run real estate company.\n\nGet up to speed on the ruling and more takeaways.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Haley vows to stay in race despite projected South Carolina primary loss: \"I'm a woman of my word\"", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/12bd58ac-2ee3-49b4-b3fd-3b6b18ce1f79.JPG", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/0708c4e1-4b34-472e-83d9-dad47934b85b.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/0ed76ea7-c2c3-4b33-8cc4-a564b27685e3.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f60e4209-6515-4b60-85d9-531cfcc782bc.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/35f9389a-30e1-469f-b2c4-719d6bfb541e.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/12bd58ac-2ee3-49b4-b3fd-3b6b18ce1f79.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/13f0ae5f-a415-4f24-b8dc-a0c98aff01ae.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/19ef2c6a-da53-4856-a3d0-edbc3b29323b.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/south-carolina-primary-02-24-24/h_1771a9ef451f8bdd019c8acd3181f42d", "date": "2024-02-25", "short_description": "The latest on the South Carolina GOP primary and 2024 campaign  CNN", "text": "Nikki Haley walks on stage at her watch party during the South Carolina Republican presidential primary election in Charleston, South Carolina, on February 24. Brian Snyder/Reuters\n\nFormer South Carolina Gov. Nikki Haley said she will continue running for president, even after her projected loss in the GOP primary in her home state.\n\n\"I'm a woman of my word,\" she said in Charleston, South Carolina, referring to her earlier pledge to stay in the race until Super Tuesday. \"I'm not giving up this fight when a majority of Americans disapprove of both Donald Trump and Joe Biden.\"\n\nHaley’s remarks were presented in a more somber tone, compared to her speech following the New Hampshire primary.\n\nShe said she does not believe Trump can beat Biden in a rematch presidential election, saying that \"Trump drives people away.\"\n\nHaley also acknowledged she lost by a wide margin, but highlighted “40% is not some tiny group.” She made the case that while she has lost four states to the former president, there are many more that still haven’t voted.\n\n\"In the next 10 days, another 21 states and territories will speak. They have the right to a real choice, not a Soviet-style election with only one candidate,\" she said. \"And I have a duty to give them that choice.\"\n\nShe also went on to reiterate she isn’t running for the vice presidency.\n\nCNN's Ebony Davis contributed reporting.\n\nThis post has been updated with more of Haley's comments.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "February 23 - 2024 campaign updates", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240223140706-dle-south-carolina-early-voting-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/db9131bd-f7f1-4e69-b218-b504769e5098.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/158d3c78-7d43-4bbb-9be0-d3545b2d55c9.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240223140706-dle-south-carolina-early-voting-super-tease.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/q_auto/https%3A%2F%2Fmedia.cnn.com%2Fapi%2Fv1%2Fimages%2Fstellar%2Fprod%2Fscreen-shot-2024-02-23-at-4-05-18-pm.jpg%3Fc%3D16x9%26q%3Dw_800%2Cc_fill", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/92279461-a2ab-432a-a7d7-5ec08eb36da8.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/election-news-south-carolina-02-23-24/index.html", "date": "2024-02-24", "short_description": "February 23 - 2024 campaign updates  CNN", "text": "Ahead of Saturday's primary, South Carolina supporters of former President Donald Trump shared their thoughts on controversial topics from his comments on the Alabama IVF ruling to him saying Russia can do \"whatever the hell they want\" to any NATO country that doesn’t meet spending guidelines on defense and more.\n\nHere's what they had to say:\n\nOn the Alabama IVF ruling: Katie Alexander, who said she underwent IVF to get pregnant with her daughter, said she thought the Alabama Supreme Court ruling frozen embryos were children was a “dangerous slippery slope.\"\n\n“It makes it very, very muddy,\" she said of the ruling, calling for new laws on the procedure to be passed.\n\nOn Trump using campaign funds to pay for legal fees: Some supporters were split on whether Trump should be using campaign funds to pay for his legal bills.\n\n“Well, I don’t know what the laws are but I will tell you that people who donate to Trump’s campaign would have no problem with him using the money to pay some of his bills. I really believe that,” Carolyn Corcoran said.\n\nBarbara Gobien said, “It doesn’t matter to me if they want to use it.”\n\nRuth Carroll expressed distrust in media reports and said she'd need to see proof first of Trump using campaign fees for his bills. But when asked if hypothetically it would be something she would support, Carroll said she would not.\n\nOn Trump’s NATO comments: Some supporters said they thought Trump wasn’t being serious when he encouraged Russia to do whatever it wanted to NATO countries that didn’t meet spending guidelines, and believed the US would still protect those countries if Trump were reelected.\n\n“He says things in a kind of way that people just don’t understand,\" Corcoran said. \"But I don’t take what he says as meaning anything serious.”\n\nBut Barbara Gobien, said she agreed with Trump’s comments.\n\n“Nobody should be allowed to be part of anything if they don’t pay their share and too many countries have lived off our backs and it’s about time that changed,” Gobien said. “Trump’s the first person that made that statement and he started getting people to pay their fair share.”", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Trump Georgia case hearing on motion to disqualify Fani Willis", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240215150115-fani-willis-court-february-15-2024-01-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240215150115-fani-willis-court-february-15-2024-01-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1e2ce289-7ea6-492f-b1b6-a4ddcdf8f034.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/34848b47-f6ab-4e89-8128-06db0c64a54c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/43b24ea1-e41e-4fed-b91b-b6f374c5d986.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/169bc339-f8c3-4f4f-bc60-9ee46dfee88c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/786edcfa-141b-40c0-8de2-a7fdd87f9d87.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/483cf3a6-6a30-4392-ad0f-3657e26c19ea.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/georgia-trump-fani-willis-hearing-02-16-24/index.html", "date": "2024-02-16", "short_description": "Live updates: Trump Georgia case hearing on motion to disqualify Fani Willis continues  CNN", "text": "The evidentiary hearing in Georgia over whether to disqualify Fulton County District Attorney Fani Willis has concluded for the time being, a judge said Friday.\n\nThe attorneys will likely have to return in the next few weeks to discuss outstanding issues, including whether Nathan Wade, the special prosecutor Willis hired to lead the case, can still assert attorney-client privilege over some testimony and evidence from his former law partner and divorce attorney, Terrence Bradley.\n\nBoth defense attorneys and prosecutors also will have the opportunity to file additional legal briefs as they see fit.\n\nThe evidentiary hearing included a tumultuous two days of testimony, including from Willis herself. Before the hearing concluded, the district attorney’s office sought to undermine Bradley’s credibility, including by raising an allegation of sexual assault by an employee of his former law firm. Bradley denied the allegation.\n\nBradley testified earlier Friday that he left the firm following a “disagreement,” but said the details of the disagreement were privileged. During cross examination, Bradley was pressed on whether he left because of a disagreement over a sexual assault allegation made against him.\n\n“That is not correct,” Bradley said, but confirmed that he was accused of sexually assaulting a member of the firm.\n\nThe judge presiding over the case, Scott McAfee, questioned whether Bradley had been properly interpreting the privilege he had previously asserted over communications with Wade, given his testimony on the allegation.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Auto jobs aren’t as dominant in Michigan as they once were", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7c8d2983-c379-4c89-bc8e-b62e8cc565e6.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/fc0070bb-f4a7-44d1-8aef-4103d1ab860b.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7281ed84-4478-4b12-9db7-c8302417263c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7c8d2983-c379-4c89-bc8e-b62e8cc565e6.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e39e9c2f-668b-4c05-b177-a5c1da774633.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d4f4e2ea-4521-449d-ad79-5a3d3042dc89.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/3264073d-d35f-4fb4-810c-8b00cfc97530.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_80d7e1d0f547c25fe02ee2ba63e0a2e0", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "In this 2021 photo, a 2021 Jeep Grand Cherokee L goes through assembly at the Stellantis Detroit Assembly Complex-Mack in Detroit. Bill Pugliano/Getty Images\n\nFew states are as closely associated with a single industry as Michigan and autos, which is holding its Republican and Democratic primaries today. But auto jobs aren’t as dominant in the state as they once were. Michigan has lost many of the automotive jobs it once had to other parts of the country.\n\nJobs in the state’s auto plants, parts factories and corporate offices shrank by 35% since 1990, according to figures from the Bureau of Labor Statistics. And those jobs make up only 3.7% of the jobs in the state, roughly half what it was in 1990. Today, more than four times as many workers in Michigan have jobs at one of the state’s hospitals than at an auto assembly plant.\n\nSome of the auto jobs disappeared because of automation. Some evaporated as auto plants moved to Mexico since the passage of NAFTA and as some auto manufacturing shifted to nonunion plants in Southern states.\n\nWith cars far more technologically complex today, many tech jobs in the state focus on serving the auto industry, along with traditional support industries like trucking and other suppliers that don’t show up as auto parts makers.\n\nTake a look:", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "\"Uncommitted supporters\" claim a measure of success in getting President Biden's attention", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/4caecad9-080a-4a4f-b07b-58980a03376a.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1f047aca-a333-44e4-8ddf-b53c8e56f319.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e203b6be-ed70-4251-8a5a-e662738fe16f.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/af03a075-3d3e-4268-8951-160e990700bd.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/5f306437-04c3-4292-9d8e-05aefda44a25.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_10e72521a2b86062fd90f9fc1b7a209c", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "An enthusiastic crowd has gathered at Adonis, a Middle Eastern restaurant in Dearborn, Michigan, where supporters of the movement urging voters to check “uncommitted” are celebrating what they see as one early measure of progress — getting President Joe Biden’s attention.\n\nWhile some vocal supporters of this movement say they will never vote for Biden, and intend to leave their ballots blank in November rather than vote for Biden or Donald Trump, others are more pragmatic and hope their protest votes prompt a policy change from the administration.\n\n“We are moving in the traditions of anti-war protestors who came before us,” said Abbas Alawieh, a spokesman for Listen to Michigan, who called for a moment of silence for the children killed in Gaza. “Stop killing our families, that’s all we’re asking for.”\n\nEven as the votes were still being counted Tuesday night, organizers of Listen to Michigan deemed their campaign a success.\n\n“We demand President Biden to take action now — bring a permanent ceasefire,” said Layla Elabed, the campaign manager for the group. “A vote 'uncommitted' was a humanitarian vote.”\n\nShe said the effort was just beginning, with plans to keep pressure alive on the president in the eight months until the November election.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Biden’s political operation has expanded its financial advantage over Trump’s campaign", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f4ec115c-9a2c-4ce8-bc33-3cc0e247aab2.png", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e39e9c2f-668b-4c05-b177-a5c1da774633.JPG", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/593ee239-07d6-4169-a044-be711ea6a9d6.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/533d6455-9f9d-4111-b622-c1b0a1a703e4.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/8150921f-df52-4948-8c38-254dba346ad1.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/b77d4bf7-407b-4696-80df-c1cebf61970a.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/879df60a-a190-4423-9b25-bee84933f27c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/22fc2cbc-0d58-4385-a5f3-95efc8e4dfba.JPG"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_c9c6db3cd366b0d1a4c6bb788d0f01aa", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "A man votes in Detroit on Tuesday. Dieu-Nalio Chery/Reuters\n\nPresident Joe Biden and former President Donald Trump are expected to win handily in their respective contests, but there will be lessons to learn for both.\n\nHere’s what to watch for in Michigan:\n\nThe first ballot test of Biden’s Israel strategy: Biden’s support for Israel – whose war in Gaza has killed roughly 30,000 Palestinians, according to the enclave's health ministry – has enraged American progressives, many of them Jewish, and Arab Americans. The Michigan city of Dearborn is home to one of the largest Arab American communities in the US. That anger is fueling a statewide movement among Democratic critics of Israel for voters to mark “uncommitted” on their ballots. Just how committed are Michigan Democrats to Biden? Tuesday will tell.\n\nA fractured and confusing GOP process: The split process of awarding delegates between a Michigan Republican primary on Tuesday and a state party convention on Saturday is the result of Republicans’ reaction to Democrats’ decision to shake up the party’s presidential nominating calendar after the 2020 election — demoting Iowa and New Hampshire, moving South Carolina and Nevada to the forefront and placing Michigan third in its new lineup.\n\nTests for Biden, Trump: Biden is banking on an endorsement from the United Auto Workers union, support from Black voters, and a stronger Democratic infrastructure — with an electorate energized by an abortion rights battle delivering Gov. Gretchen Whitmer and her party victories up and down the ballot in 2022. Trump, meanwhile, is hoping to re-engineer the White working-class coalition that helped him break down the “blue wall” of Pennsylvania, Michigan, and Wisconsin in 2016.\n\nRead more about what to look out for ahead of the Michigan presidential primaries.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Trump is juggling a busy legal calendar while also hitting the campaign trail", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/fc0070bb-f4a7-44d1-8aef-4103d1ab860b.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e39e9c2f-668b-4c05-b177-a5c1da774633.JPG", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/b77d4bf7-407b-4696-80df-c1cebf61970a.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/8150921f-df52-4948-8c38-254dba346ad1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/533d6455-9f9d-4111-b622-c1b0a1a703e4.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/22fc2cbc-0d58-4385-a5f3-95efc8e4dfba.JPG"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_049cfaca4c724af3576593675f1540b8", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "A man votes in Detroit on Tuesday. Dieu-Nalio Chery/Reuters\n\nPresident Joe Biden and former President Donald Trump are expected to win handily in their respective contests, but there will be lessons to learn for both.\n\nHere’s what to watch for in Michigan:\n\nThe first ballot test of Biden’s Israel strategy: Biden’s support for Israel – whose war in Gaza has killed roughly 30,000 Palestinians, according to the enclave's health ministry – has enraged American progressives, many of them Jewish, and Arab Americans. The Michigan city of Dearborn is home to one of the largest Arab American communities in the US. That anger is fueling a statewide movement among Democratic critics of Israel for voters to mark “uncommitted” on their ballots. Just how committed are Michigan Democrats to Biden? Tuesday will tell.\n\nA fractured and confusing GOP process: The split process of awarding delegates between a Michigan Republican primary on Tuesday and a state party convention on Saturday is the result of Republicans’ reaction to Democrats’ decision to shake up the party’s presidential nominating calendar after the 2020 election — demoting Iowa and New Hampshire, moving South Carolina and Nevada to the forefront and placing Michigan third in its new lineup.\n\nTests for Biden, Trump: Biden is banking on an endorsement from the United Auto Workers union, support from Black voters, and a stronger Democratic infrastructure — with an electorate energized by an abortion rights battle delivering Gov. Gretchen Whitmer and her party victories up and down the ballot in 2022. Trump, meanwhile, is hoping to re-engineer the White working-class coalition that helped him break down the “blue wall” of Pennsylvania, Michigan, and Wisconsin in 2016.\n\nRead more about what to look out for ahead of the Michigan presidential primaries.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "3 Republicans voted against Mayorkas' impeachment", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d5f0a4fa-0c73-4255-930b-d7bb35085f04.jpg", "images": ["https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/88d93c4a-81ef-496c-996e-ec09307ae105.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/abc34072-c0d0-41e5-8b76-fd1145d26921.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e2ff91da-2ce7-4988-b5aa-a495394249f2.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/0560d505-6ed8-42b4-b71d-27720792a6fe.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/5cecfad1-e09e-4e99-8b94-3a5772dd10e7.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/52d818d7-5a2c-4a82-be16-e117691a5580.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d5f0a4fa-0c73-4255-930b-d7bb35085f04.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e8460f75-1a4f-42df-a24c-e42985070ffd.jpg"], "videos": [], "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNubi5jb20vcG9saXRpY3MvbGl2ZS1uZXdzL21heW9ya2FzLWltcGVhY2htZW50LWhvdXNlLXZvdGUtMDItMTMtMjQvaF81MDA1MmEyOTlmNWZjM2EwODZhZTBiMDE2ZDE4N2UyMtIBXmh0dHBzOi8vYW1wLmNubi5jb20vY25uL3BvbGl0aWNzL2xpdmUtbmV3cy9tYXlvcmthcy1pbXBlYWNobWVudC1ob3VzZS12b3RlLTAyLTEzLTI0L2luZGV4Lmh0bWw?oc=5&hl=en-US&gl=US&ceid=US:en", "date": "2024-02-13", "short_description": "House impeaches Homeland Security Secretary Alejandro Mayorkas  CNN", "text": "House Speaker Mike Johnson announces the vote to impeach Homeland Security Secretary Alejandro Mayorkas has passed. House TV\n\nThe GOP-led House has voted to impeach Homeland Security Secretary Alejandro Mayorkas. He is the first Cabinet secretary to be impeached in nearly 150 years.\n\nThe vote tally was 214 to 213. Three Republicans voted with Democrats against the measure.\n\nThis comes after House Republicans failed to impeach Mayorkas in a vote last week. The absence of House Majority Leader Steve Scalise, and the surprise attendance by Texas Democrat Al Green, who had just had surgery and was wheeled into the chamber to vote, denied Republicans the votes to pass when it came up previously.\n\nHouse Republicans claim Mayorkas has committed high crimes and misdemeanors for his handling of the southern border, even though several constitutional experts have said the evidence does not reach that high bar.\n\nThe impeachment effort comes as House Republicans have faced building pressure from their base to hold the Biden administration accountable on a key campaign issue: the border.\n\nWhat happens next: It is highly unlikely that Mayorkas will be charged in the Democratic-controlled Senate. Senate Democrats are still weighing how to respond on Mayorkas' impeachment: to Move ahead with a trial, or move to dismiss it quickly given their view that it’s blatantly political.\n\nHere's a breakdown of the vote:", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Your guide to the special election happening in New York's 3rd Congressional District", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/a8571092-f64a-4760-a635-3152083a6fc5.jpg", "images": ["https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240229184715-gaza-destruction-jabalya-022224-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7016319a-fd4d-4275-956f-ebff5b0c24df.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/a8571092-f64a-4760-a635-3152083a6fc5.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240223210059-donald-trump-february-23-2024-rock-hill-south-carolina-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d06479af-3427-4406-884f-88680d98a3c0.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/ny-special-election-santos-02-13-24/h_59ae4f38c61d76e470423a884e75650d", "date": "2024-02-14", "short_description": "Your guide to the special election happening in New York's 3rd Congressional District  CNN", "text": "A voter casts a ballot at a polling station inside Robert Finley Middle School in Glen Cove, New York, on Tuesday. Jeenah Moon/Bloomberg/Getty Images\n\nWith less than three hours left to vote in the special election in New York's 3rd Congressional District, residents are continuing to cast their ballots to choose whether Democrat Tom Suozzi or Mazi Pilip, who is running as a Republican, will replace ousted congressman George Santos.\n\nIn Nassau County: As of 6 p.m. ET, more than 56,000 residents of the district have voted, according to Nassau County Board of Elections Democratic Commissioner James Scheuerman.\n\nOf those who cast ballots, 20,033 are registered Democrats, 21,675 are registered Republicans, 12,309 are voters with no party affiliation and 2,585 are from other parties.\n\nIn Queens: There has been a total of 20,396 votes so far in this part of the 3rd District. This includes early votes, absentee votes, and votes cast today, according to information posted on social media by the New York City Board of Elections, which does not break down the turnout according to party affiliation.\n\nThere are 421,855 registered voters in Nassau County and approximately 104,000 registered voters in Queens.\n\nBoth Nassau County and the New York City Board of Elections are giving these numbers based on those who check in at polling sites.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Fulton County prosecutor's divorce attorney to testify in Fani Willis case", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-super-tease.jpeg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-super-tease.jpeg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/52c16957-cf54-43e7-8871-19a037a2578e.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240229184715-gaza-destruction-jabalya-022224-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f939e4f3-7e7e-495a-88a8-678ed46fcb33.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ca26e479-2805-4ca4-a116-1c75d2a6184c.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240223210059-donald-trump-february-23-2024-rock-hill-south-carolina-small-11.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/fani-willis-case-fulton-county-hearing-02-27-24#h_1c6c48128cb121dae5597ccfaa2ecf10", "date": "2024-02-27", "short_description": "Live updates: Fulton County prosecutor's divorce attorney to testify in Fani Willis case  CNN", "text": "Terrence Bradley walks to the witness stand at the Fulton County Courthouse on February 27. Brynn Anderson/Pool/Getty Images\n\nThis hearing is about evidence Terrence Bradley might have had, and for the defense teams that called him to the stand, he didn't deliver.\n\n\"He'd made some comments to you along the way that led you to believe he had more knowledge than today he's testifying that he had,\" Judge Scott McAfee said bluntly to defense attorney Ashleigh Merchant on Tuesday afternoon.\n\nMerchant and other defense lawyers in the Georgia election subversion case have been trying to stand up, with days of evidence and witness testimony, allegations that Fulton County District Attorney Fani Willis and the lead prosecutor she hired for the Trump case, Nathan Wade, began an ethically dubious relationship earlier than they've said. Both have testified the relationship started after Wade joined Willis' office in late 2021.\n\nBradley, a hesitant witness, was finally forced on Tuesday to speak about the years of 2015 to 2022, when he was Wade's law partner and divorce lawyer.\n\nBradley had chatted with Merchant over text in recent months about the Wade-Willis relationship starting earlier than that, according to Tuesday's proceeding.\n\nMerchant recounted in court she had texted Bradley, \"'Do you think it started before she hired him?' And you said, 'Absolutely.\"\n\n\"Do you recall me asking how they would react? Would they attack me? And you told me that they would deny it,\" Merchant added.\n\nTo that, though, Bradley testified repeatedly he was just speculating.\n\nThe defense lawyers, one after another in court, grew frustrated — and confirmed with Bradley he had no direct conversations with Wade or proof of the prosecutors' relationship beginning more than two years ago.\n\n\"I never witnessed anything,\" Bradley said under oath. \"I do not have knowledge of it starting, or when it started.\"\n\nHe said he remembers only one conversation, at a time he can't recall, that Wade told him Wade and Willis were dating.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "A look at Michigan's demographics: The state's population is rapidly growing older", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ddf9b2aa-f6ab-4de6-8d70-b05cf6baaf6f.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7c8d2983-c379-4c89-bc8e-b62e8cc565e6.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230917171655-trump-biden-split-0917-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ae9434cf-07fe-4864-b8cd-11be33c18a6c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1b5a4083-27eb-4873-a8a8-97c537156ce9.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/7433e14c-beb5-49f0-8dd9-a5422e039435.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/a24dfc6a-c73a-41ec-8de4-d009226f4a7c.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/michigan-primary-02-27-24/h_8ba2ae7b9f824740c810839f3d6adc34", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "Michigan’s population is rapidly growing older. It was the 29th oldest state in 2001, but the 14th oldest by 2021, according to the Michigan Center for Data and Analytics. The share of residents aged 55 and older is expected to increase by 14% between 2021 and 2050.\n\nThat demographic trend is spurring growth in the state’s health care industry — both for workers and facilities, said Brian Peters, CEO of the Michigan Health & Hospital Association.\n\nHealth care is already the state’s largest employer, with more than 500,000 jobs at the end of 2023. But there are at least 27,000 job openings in hospitals for workers at all levels. One rural hospital recently had to temporarily close its cafeteria because of a lack of staff, Peters said. Many nurses and other clinicians are also approaching retirement age, which increases the pressure to hire.\n\nThe need will only grow as more Michigan residents hit their senior years.\n\n“Those folks who are headed off to their retirement days, they are the ones who demand more health care services,” Peters said, noting that outpatient clinics, ambulatory surgical centers, rehab and skilled nursing facilities and specialty doctors’ offices and other providers are all expanding.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "House GOP's majority shrinks as Democrats flip Santos' New York seat", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240213224502-dle-tom-suozzi-021324-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240213224502-dle-tom-suozzi-021324-super-tease.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/aa94c8c9-161b-423b-8cd5-9070666ca6cc.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/11fff145-54b5-4cd4-b0ec-b2e6e207f76e.JPG", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/5d957f28-cbed-4c59-9134-9f55fb2eaf25.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d3d33f0b-f016-436f-9058-0828411b02c9.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d9010ad2-a22c-4a44-9442-9096cfef4db5.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/ny-special-election-santos-02-13-24/index.html", "date": "2024-02-14", "short_description": "House GOP's majority shrinks as Democrats flip Santos' New York seat  CNN", "text": "Newly elected US House Speaker Mike Johnson speaks after his election at the US Capitol in Washington, DC, on October 25, 2023. Tom Brenner/AFP/Getty Images\n\nRepublican House Speaker Mike Johnson is overseeing one of the smallest House majorities in history – and Democrat Tom Suozzi’s win in a New York special election will shrink it further.\n\nSuozzi defeated Republican Mazi Pilip in a race for the seat previously held by former GOP Rep. George Santos who was expelled from Congress last year.\n\nWhen Suozzi is sworn in, Republicans will control 219 seats and Democrats will control 213. With a breakdown of 219 to 213, House Republicans will only be able to lose only two votes to pass legislation on party-line votes if all members are present and voting\n\nAfter the swearing in, there will be three vacancies in the House. Former New York Democratic Rep. Brian Higgins resigned from Congress earlier this month, former Ohio GOP Rep. Bill Johnson resigned last month and former Speaker Kevin McCarthy resigned at the end of last year.\n\nIn addition to the tight margin, there is always the possibility that absences could further impact the vote math. The razor-thin majority presents an enormous challenge for the speaker, leaving Johnson with almost no room for error as he navigates demands from competing wings of his party.\n\nHardline conservatives have already shown they can hold major sway in the chamber with such a narrow majority – most notably when a group of hardliners moved to oust McCarthy from the speakership in a historic vote last year.\n\nRead more about the House GOP's shrinking majority.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "How many delegates Joe Biden has so far", "top_image": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c518edbc-fd29-4c4b-a397-e37682333ef0.jpg", "images": ["https://dynaimage.cdn.cnn.com/cnn/digital-images/org/53b9e4cc-cff1-4c1b-bf10-f1c5f4ef1dff.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c8cc3e67-5837-460c-b42b-10b2f2636ced.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/f4b9d92e-a5bd-452c-b8dc-90ee4dc17c1f.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/676e5027-8647-4cf6-8a57-0cbdf31c355c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/22f50626-e202-4c35-aad7-a7445adfdb5f.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/c518edbc-fd29-4c4b-a397-e37682333ef0.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/1378dfad-f142-4166-9961-62ae5b640cfa.jpg"], "videos": [], "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNubi5jb20vcG9saXRpY3MvbGl2ZS1uZXdzL21pY2hpZ2FuLXByaW1hcnktMDItMjctMjQvaF9lMGZlY2MwMWM2NTA5NmM2ZjdhNGU4YTkzZTBlYzlkMdIBT2h0dHBzOi8vYW1wLmNubi5jb20vY25uL3BvbGl0aWNzL2xpdmUtbmV3cy9taWNoaWdhbi1wcmltYXJ5LTAyLTI3LTI0L2luZGV4Lmh0bWw?oc=5&hl=en-US&gl=US&ceid=US:en", "date": "2024-02-28", "short_description": "Live updates: Michigan presidential primary election  CNN", "text": "President Joe Biden speaks at the North American International Auto Show in September 2022 in Detroit, Michigan. Bill Pugliano/Getty Images\n\nPresident Joe Biden is the only Democratic candidate to earn any delegates so far after he cruised to victory in Michigan on Tuesday. The party will use the results of the state's primary to allocate their delegates to the national convention.\n\nHere is the CNN Democratic delegate estimate from Michigan as of 10:35 p.m. ET.\n\nBiden: 87\n\nUnallocated: 30\n\nTotal pledged delegates won to date:\n\nBiden: 178\n\nAt least 1,968 pledged delegates are required to win the Democratic nomination.\n\nThis post has been updated with the latest numbers.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Live updates: Fani Willis testifies in Trump Georgia case hearing", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/230109112258-trump-willis-split-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240226163121-01-early-voting-michigan-021724-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/db4f80db-95b1-4242-a50d-a7c268490174.jpg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/e46a8d41-3bb4-4632-be97-ca47ed16bd04.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/24900c31-f725-4cfe-ad62-3dc6777ed782.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240224163454-ukraine-trench-soldier-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240112215135-fani-willis-wade-august-14-2023-small-11.jpeg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/2d0dcb57-0baa-4701-9105-ec305a521cf4.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230109112258-trump-willis-split-super-tease.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/trump-hearings-ny-georgia/index.html", "date": "2024-02-15", "short_description": "Live updates: Trump NY hush money, Georgia misconduct hearings  CNN", "text": "Fulton County District Attorney Fani Willis testifies during a hearing on the Georgia election interference case on Thursday in Atlanta. Alyssa Pointer/Pool/AP\n\nIn an extraordinary moment in court Thursday, Fulton County District Attorney Fani Willis testified about sexist behavior from Nathan Wade, the top prosecutor on the election interference case with whom she once had a romantic relationship.\n\n“It's interesting that we're here about this money. Mr. Wade is used to women that, as he told me one time: 'The only thing a woman can do for him is make him a sandwich,'” she testified as she faced tough questioning from defense attorney Steve Sadow, who represents Donald Trump, about whether their romantic relationship ended last summer because of the forthcoming indictment against the former president and his allies.\n\n“We would have brutal arguments about the fact that I am your equal,\" she continued. \"I don't need anything from a man — a man is not a plan. A man is a companion. And so there was tension always in our relationship, which is why I would give him his money back. I don't need anybody to foot my bills. The only man who's ever foot my bills completely is my daddy.”\n\nThe defense attorneys have zeroed in on the timing of when the Willis-Wade relationship ended because it's critical to their self-dealing allegations against Willis.\n\nIn court filings, defendant Mike Roman's team argued that Willis would be incentivized to bring an indictment because it would prolong the case, and keep the money flowing to Wade. And, according to their theory, back to her as well, through vacations and other gifts.\n\nWillis said on the stand that their break-up had “absolutely nothing” to do with the indictment.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}, {"title": "Polls are closing in New York’s 3rd Congressional District. Here are key things to know about the election", "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/240213224502-dle-tom-suozzi-021324-super-tease.jpg", "images": ["https://cdn.cnn.com/cnnnext/dam/assets/240213224502-dle-tom-suozzi-021324-super-tease.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/cd582793-9487-4a8b-92d7-3ae618aa06b0.jpeg", "https://cdn.cnn.com/cnn/2019/images/03/20/live-story-status_light.gif", "https://cdn.cnn.com/cnnnext/dam/assets/240227145233-rafah-022724-small-11.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/240228174010-dle-government-shutdown-small-11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/fc606d35-f4a5-4e8d-a3ef-c5a8ed666698.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/9ed24857-c24c-4cd6-87f1-99fde2697a11.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/ce1d0aa6-5697-463c-972c-afcc30f2117c.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/cbab4e8b-0183-4d19-a5c9-b7bcf681c491.JPG", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/a8571092-f64a-4760-a635-3152083a6fc5.jpg", "https://cdn.cnn.com/cnnnext/dam/assets/230422112329-biden-trump-split-042223-small-1-1.jpg", "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/d06479af-3427-4406-884f-88680d98a3c0.jpg"], "videos": [], "url": "https://edition.cnn.com/politics/live-news/ny-special-election-santos-02-13-24/h_0ba3d8d41b396d9cde80fec69af71f7d", "date": "2024-02-15", "short_description": "House GOP's majority shrinks as Democrats flip Santos' New York seat  CNN", "text": "It's 9 p.m. ET, and polls are closing in New York's 3rd Congressional District where voters are casting their ballots in a special election to fill the vacant seat of former GOP Rep. George Santos.\n\nNominees were chosen by county party leaders in the district.\n\nDemocrats nominated former Rep. Tom Suozzi, who represented a previous version of the 3rd District for three terms before launching an unsuccessful primary campaign for governor in 2022. Republicans nominated Mazi Pilip, a county legislator who was born in Ethiopia and immigrated to the US from Israel.\n\nThe contest has national stakes and could serve as a bellwether for the mood of the electorate this presidential cycle.\n\nFirst results to look out for: Because this is the first election that will be held under a new law that allows all New Yorkers to vote by mail without an excuse, election officials in Nassau and Queens counties will count these ballots before polls close. Mail and early in-person votes will be reported first.", "publisher": {"href": "https://www.cnn.com", "title": "CNN"}}]